CSI API ETABS v1
cCaseResponseSpectrum.GetDampInterpolated Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDampInterpolated(
	string Name,
	ref int DampType,
	ref int NumberItems,
	ref double[] Time,
	ref double[] Damp
)
Function GetDampInterpolated (
	Name As String,
	ByRef DampType As Integer,
	ByRef NumberItems As Integer,
	ByRef Time As Double(),
	ByRef Damp As Double()
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim DampType As Integer
Dim NumberItems As Integer
Dim Time As Double()
Dim Damp As Double()
Dim returnValue As Integer
returnValue = instance.GetDampInterpolated(Name,
	DampType, NumberItems, Time, Damp)
int GetDampInterpolated(
	String^ Name,
	int% DampType,
	int% NumberItems,
	array<double>^% Time,
	array<double>^% Damp
)
abstract GetDampInterpolated :
        Name : string *
        DampType : int byref *
        NumberItems : int byref *
        Time : float[] byref *
        Damp : float[] byref -> int
Parameters
Name
Type: System.String
DampType
Type: System.Int32
NumberItems
Type: System.Int32
Time
Type: System.Double[]
Damp
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace